{"status":"ok","totalResults":17370,"articles":[{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Sarah Perez","title":"Apple launches the ‘Apple Teacher Portfolio recognition, updates Schoolwork and Classroom apps","description":"Apple this morning announced a handful of education-related updates to its suite of classroom apps as well as a new recognition for teachers, called the Apple Teacher Portfolio. Teachers who complete a total of nine lessons where they learn foundational skill…","url":"http://techcrunch.com/2021/03/23/apple-launches-the-apple-teacher-portfolio-recognition-updates-schoolwork-and-classroom-apps/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/03/Apple_expands-free-professional-learning-to-help-teachers-champion-creativity_032321_big.jpg.large_2x.jpg?w=621","publishedAt":"2021-03-23T14:20:39Z","content":"Apple this morning announced a handful of education-related updates to its suite of classroom apps as well as a new recognition for teachers, called the Apple Teacher Portfolio. Teachers who complete… [+3860 chars]"},{"source":{"id":null,"name":"Lifehacker.com"},"author":"David Murphy","title":"How to Find COVID Vaccination Sites in Apple Maps","description":"While we can’t help you find a vaccination appointment—good luck, given how terribly we’ve orchestrated the process and turned it into a kind of free-for-all reminiscent of buying concert tickets, shoes, or GeForce 3080 cards—we can at least give you a useful…","url":"https://lifehacker.com/how-to-find-covid-vaccination-sites-in-apple-maps-1846497197","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/jg1ccu0ovwdk1wmzcleb.jpg","publishedAt":"2021-03-18T13:30:00Z","content":"While we cant help you find a vaccination appointmentgood luck, given how terribly weve orchestrated the process and turned it into a kind of free-for-all reminiscent of buying concert tickets, shoes… [+1671 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"https://www.engadget.com/about/editors/saqib-shah","title":"Apple pulls more iMac models ahead of possible M1 refresh","description":"Apple has stopped selling two versions of the 21.5 inch iMac amid rumors that it's planning a new all-in-one workstation.","url":"https://www.engadget.com/apple-pulls-imac-models-m1-refresh-103829331.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2021-03/5a3bdd40-8af7-11eb-bfe7-331ff757c3cf","publishedAt":"2021-03-22T10:38:29Z","content":"Apple's spring cleaning checklist seems largely devoted to the iMac this year. After discontinuing the iMac Pro earlier this month, it's now scrapped the 512GB and 1TB SSD configurations of the 21.5 … [+1027 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"https://www.engadget.com/about/editors/jon-fingas","title":"Apple wants Tim Cook, Tim Sweeney to testify in Epic lawsuit","description":"Apple and Epic have produced witness lists for an App Store lawsuit that would include Tim Cook, Tim Sweeney and other major executives.","url":"https://www.engadget.com/tim-cook-sweeney-may-testify-in-apple-epic-lawsuit-214754232.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2020-08/f1bbc080-d8e7-11ea-bdfc-7d0e20614372","publishedAt":"2021-03-20T21:47:54Z","content":"Apple and Epic have drawn up their potential witness lists for Epic Games' lawsuit over allegedly anti-competitive App Store practices, and it's nearly a who's who of the leadership at both companies… [+1463 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"https://www.engadget.com/about/editors/jon-fingas","title":"Apple to pay $308.5 million for allegedly violating a DRM patent","description":"Apple has been ordered to pay $308.5 million in a lawsuit alleging that the copyright protection in the App Store and Music violates PMC's patents.","url":"https://www.engadget.com/apple-to-pay-pmc-over-drm-patent-195724335.html","urlToImage":"https://s.yimg.com/os/creatr-images/2020-04/afa0bf60-797a-11ea-bbfb-f3aaedc3f2d2","publishedAt":"2021-03-21T19:57:24Z","content":"Apple's copyright protection technology is about to cost the company dearly. Bloomberg says a Marshall, Texas court has ordered Apple to pay $308.5 million to Personalized Media Communications for al… [+978 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Kim Lyons","title":"Apple discontinuing two configurations of its 21.5 inch iMac","description":"Two configurations of the 21.5-inch iMac are now joining the Pro in retirement: the 512GB and 1TB SSD configurations are no longer available for purchase, with only the 256GB SSD and 1TB Fusion drive versions available on Apple’s website.","url":"https://www.theverge.com/2021/3/20/22341882/apple-discontinuing-21-5-inch-imac","urlToImage":"https://cdn.vox-cdn.com/thumbor/ew4L4I4w6K_rhX9YtOzJqeLTvA8=/0x173:2856x1668/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21695705/Screen_Shot_2020_08_04_at_11.10.17_AM.png","publishedAt":"2021-03-20T17:12:19Z","content":"The 512GB and 1TB SSD configurations are no longer available for purchase on Apples website\r\nThe 21.5 and 27 inch iMacs\r\nImage: Apple\r\nApple recently discontinued the iMac Pro, and two configurations… [+1035 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Ian Carlos Campbell","title":"The Apple Card doesn’t actually discriminate against women, investigators say","description":"The New York State Department of Financial Services has found that Goldman Sachs is not discriminating against Apple Card applicants on the basis of sex or marital status. Regulators initially began investigating the bank because of tweets complaining about u…","url":"https://www.theverge.com/2021/3/23/22347127/goldman-sachs-apple-card-no-gender-discrimination","urlToImage":"https://cdn.vox-cdn.com/thumbor/9bvyBvVeuce82kPx5LwLF1c7UZ8=/0x47:2416x1312/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15988557/Screen_Shot_2019_03_26_at_1.46.09_PM.png","publishedAt":"2021-03-24T00:34:16Z","content":"Credit limits were determined by criteria like credit history and income\r\nImage: Apple\r\nGoldman Sachs credit card policies were called into question when Basecamp designer David Heinemeier Hansson an… [+2079 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Sarah Perez","title":"New York’s Department of Financial Services says Apple Card program didn’t violate fair lending laws","description":"The New York State Department of Financial Services (NYDFS) released a report today that cleared the Apple Card credit card program of discriminatory practices and specifically, gender-based discrimination, following an investigation triggered by online compl…","url":"http://techcrunch.com/2021/03/23/new-yorks-department-of-financial-services-says-apple-card-program-didnt-violate-fair-lending-laws/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/03/apple-card-final.jpg?w=640","publishedAt":"2021-03-23T17:51:39Z","content":"The New York State Department of Financial Services (NYDFS) released a report today that cleared the Apple Card credit card program of discriminatory practices and specifically, gender-based discrimi… [+6539 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"https://www.engadget.com/about/editors/igor-bonifacic","title":"Apple's HomePod mini apparently has an inactive temperature and humidity sensor","description":"iFixit found the sensor hidden away from the mini's other internal components.","url":"https://www.engadget.com/apple-homepod-mini-inactive-temperature-humidity-sensor-161634669.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2020-11/1bc384d0-2528-11eb-bd2c-8fa277bbfd4b","publishedAt":"2021-03-22T16:16:34Z","content":"There may be more to the HomePod mini than Apple first let on. The smart speaker features a component that the company has yet to disclose, according to Bloomberg. That component is a sensor made by … [+1324 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Victoria Song","title":"You Don't Actually Want a Wraparound Smartwatch","description":"A newly unearthed Apple patent shows the company is has dreams of a wraparound Apple Watch. But until designers figure out how to make wraparound smart watches comfortable, breathable, and water resistant, this idea should stay in the trash pile.","url":"https://gizmodo.com/you-dont-actually-want-a-wraparound-smartwatch-1846534270","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/r1w5dr451opuqzo5dhmr.jpg","publishedAt":"2021-03-23T15:41:00Z","content":"I get it. A flexible OLED display that extends all the way around your wrist looks cyberpunk as hell. But as cool as it soundsand looksthis is a bad wearable design that benefits no one other than sc… [+4759 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"https://www.engadget.com/about/editors/mat-smith","title":"The Morning After: Brazil wants in-box chargers with new iPhones","description":"Apple is fined in Brazil for selling iPhones without a charger, while Coinbase is fined $6.5 million over cryptocurrency trading claims. Also:  Donald Trump is planning his very own social network.","url":"https://www.engadget.com/the-morning-after-114504162.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2021-03/05d492d0-8af5-11eb-b37d-83c2415dfacf","publishedAt":"2021-03-22T11:45:04Z","content":"Getting rid of smartphone excess is hard. Just ask Apple. When it launched the iPhone 12 series without chargers or headphones in the box, the company had to immediately accommodate French laws by in… [+4024 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Sarah Perez","title":"Fleksy co-founder is suing Apple over lost revenue resulting from App Store scammers","description":"Kosta Eleftheriou, a co-founder of the Fleksy keyboard app later sold to Pinterest in an acqui-hire deal, has been calling attention to Apple App Store issues like fake reviews, ratings and subscription scams, as well as malicious clone apps, after his own ap…","url":"http://techcrunch.com/2021/03/18/fleksy-co-founder-is-suing-apple-over-lost-revenue-resulting-from-app-store-scammers/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/03/apple-app-store-ios-2021.jpg?w=712","publishedAt":"2021-03-18T12:32:57Z","content":"Kosta Eleftheriou, a co-founder of the Fleksy keyboard app later sold to Pinterest in an acqui-hire deal, has been calling attention to Apple App Store issues like fake reviews, ratings and subscript… [+5989 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Lily Hay Newman","title":"Apple Bent the Rules for Russia. Other Nations Will Take Note","description":"Russian iPhone buyers will soon be prompted to install software developed in that country, setting a precedent that other authoritarian governments may follow.","url":"https://www.wired.com/story/apple-russia-iphone-apps-law/","urlToImage":"https://media.wired.com/photos/6051455ef40c70fa86c7d2d6/191:100/w_1280,c_limit/Sec_iphone_russia-1229232253.jpg","publishedAt":"2021-03-17T17:48:18Z","content":"Beginning in April, new iPhones and other iOS devices sold in Russia will include an extra setup step. Alongside questions about language preference and whether to enable Siri, users will see a scree… [+3991 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Jay Peters","title":"Apple’s upcoming mixed reality headset will reportedly weigh less than an iPhone","description":"Apple’s long-rumored mixed reality headset could weigh less than 150 grams, according Apple analyst Ming-Chi Kuo, which would make it much lighter than many other headsets on the market.","url":"https://www.theverge.com/2021/3/23/22346564/apple-mixed-vr-virtual-augmented-reality-headset-light-ming-chi-kuo","urlToImage":"https://cdn.vox-cdn.com/thumbor/bEspe2VM_QH315QC-wUtGt5WL_c=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477047/acastro_180604_1777_apple_wwdc_0001.jpg","publishedAt":"2021-03-23T17:08:31Z","content":"Ming-Chi Kuo says it will weigh less than 150 grams\r\nIllustration by Alex Castro / The Verge\r\nApples long-rumored mixed reality headset could weigh less than 150 grams, which would make it much light… [+2275 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Mitchell Clark","title":"Here’s how the OnePlus 9 and 9 Pro compare to Samsung and Apple","description":"OnePlus has announced its OnePlus 9 and 9 Pro phones. So, how do they stack up to the competition from Samsung and Apple? We stack up the specs and features to help you decide which phone to get.","url":"https://www.theverge.com/22338919/oneplus-9-pro-vs-samsung-iphone-comparison-features-price","urlToImage":"https://cdn.vox-cdn.com/thumbor/lWmlTLiDpS3lEHJhGKDTH0W-P58=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22388898/bfarsace_4481_20210317_0077_Edit.jpg","publishedAt":"2021-03-23T15:29:06Z","content":"To Pro or not to Pro? Or maybe Samsung?\r\nPhoto by Becca Farsace / The Verge\r\nOnePlus has released its new batch of phones, the OnePlus 9 and the 9 Pro. As is the tradition with OnePlus, the phones ar… [+7340 chars]"},{"source":{"id":null,"name":"Lifehacker.com"},"author":"David Murphy","title":"Try This iOS 14.5 Option to Get Your Security Updates Sooner","description":"iOS 14.5 should be right around the corner, judging by the four developer betas we’re at right now. At this point, I wouldn’t begrudge anyone who wanted to give the updated operating system a try on their primary phone (so long as you’re going for the likely-…","url":"https://lifehacker.com/try-this-ios-14-5-option-to-get-your-security-updates-s-1846514683","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/mehweb52narjdbxbi8zd.jpg","publishedAt":"2021-03-22T14:00:00Z","content":"iOS 14.5 should be right around the corner, judging by the four developer betas were at right now. At this point, I wouldnt begrudge anyone who wanted to give the updated operating system a try on th… [+2092 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Natasha Lomas","title":"France’s competition authority declines to block Apple’s opt-in consent for iOS app tracking","description":"Apple has fended off an attempt by advertisers in France to use a competition complaint route to derail incoming pro-privacy changes in iOS that will require third party apps to obtain users’ consent before they can track them. The French competition authorit…","url":"http://techcrunch.com/2021/03/17/frances-competition-authority-declines-to-block-apples-opt-in-consent-for-ios-app-tracking/","urlToImage":"https://techcrunch.com/wp-content/uploads/2020/06/Screen-Shot-2020-06-22-at-1.55.14-PM.jpg?w=710","publishedAt":"2021-03-17T16:58:30Z","content":"Apple has fended off an attempt by advertisers in France to use a competition complaint route to derail incoming pro-privacy changes in iOS that will require third party apps to obtain users’ consent… [+3731 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Sean Hollister","title":"Apple and Epic’s top execs plan to testify live and in person this May in the Fortnite app store trial","description":"In a legal filing Friday evening, Apple revealed that CEO Tim Cook, SVP Craig Federighi, and former marketing chief and current App Store boss Phil Schiller intend to testify live and in person in the courtroom, among many other witnesses. Epic Games’ CEO Tim…","url":"https://www.theverge.com/2021/3/20/22341511/apple-epic-trial-tim-cook-tim-sweeney-craig-federighi-phil-schiller-mark-rein-testify","urlToImage":"https://cdn.vox-cdn.com/thumbor/KiF-vHNjjvtuaSUuxXkepE392c8=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21769247/VRG_TBP_Epic_VS_Apple_Textless.jpg","publishedAt":"2021-03-20T06:52:58Z","content":"Tim Cook, Phil Schiller, Craig Federighi and more\r\nIts hard to believe its only been seven months since Apple booted Fortnite off the App Store and Epic Games sprung its antitrust trap, but you wont … [+1956 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Tom Warren","title":"Intel puts Apple’s ‘I’m a Mac’ guy into new ads praising PCs","description":"Intel is bringing back the Mac vs. PC era with new ads featuring Apple’s “I’m a Mac” guy. Actor Justin Long mocks Macs in new TV commercials that praise PCs.","url":"https://www.theverge.com/2021/3/17/22335654/intel-mac-guy-new-ads-commercials-pc","urlToImage":"https://cdn.vox-cdn.com/thumbor/HUeUXCmKE8D-GQpvvtNXZh9GbUg=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22377020/LDTTUmg.jpg","publishedAt":"2021-03-17T13:03:14Z","content":"Intel has hired Apple’s former “I’m a Mac” actor Justin Long to create new ads praising PCs. Long starts each commercial with “Hello I’m a... Justin,” with the typical white background you’d find on … [+1158 chars]"},{"source":{"id":null,"name":"Lifehacker.com"},"author":"Claire Lower on Skillet, shared by Claire Lower to Lifehacker","title":"You Don't Have to Peel Ginger","description":"I have gotten more discerning about most things as I age, but the longer I am alive, the less picky I am about peels. Unlike my seven-year-old self, who wouldn’t eat an apple unless it was peeled, cored, and cut into segments, I’m now a big fan of nature’s ed…","url":"https://skillet.lifehacker.com/you-dont-have-to-peel-ginger-1846536341","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/f67kubhdakusbj4as4oe.jpg","publishedAt":"2021-03-23T17:00:00Z","content":"I have gotten more discerning about most things as I age, but the longer I am alive, the less picky I am about peels. Unlike my seven-year-old self, who wouldnt eat an apple unless it was peeled, cor… [+1856 chars]"}]}
